TOPICS = [
    ('Txt', 'Кодирование текстов'),
    ('Value', 'Информационный объём данных'),
    ('File', 'Файловая система'),
    ('Net', 'Компьютерные сети'),
    ('Speed', 'Скорость передачи данных'),
    ('Graphic', 'Кодирование изображений и звука'),
    ('IT', 'Редактирование текста'),
    ('Alg', 'Алгоритмы'),
    ('Log', 'Алгебра логики'),
    ('Graph', 'Графы'),
    ('XLS', 'Электронные таблицы'),
]


CLASSES = [
    ('7', '7 класс'),
    ('8', '8 класс'),
    ('9', '9 класс'),
    ('10', '10 класс'),
    ('11', '11 класс'),
]

LITER_CLASSES = [
    ('А', 'А'),
    ('Б', 'Б'),
    ('В', 'В'),
    ('Г', 'Г'),
    ('Д', 'Д'),
    ('Е', 'Е'),
    ('Ж', 'Ж'),
    ('З', 'З'),
    ('И', 'И'),
    ('К', 'К'),
    ('Л', 'Л'),
    ('М', 'М'),
    ('П', 'П'),
    ('У', 'У'),
    ('Э', 'Э'),
]

QUESTION_TYPES = [
    ('MC', 'Множественный ответ через ";"'),
    ('TF', 'Выбор вариантов. True/False'),
    ('SA', 'Короткий ответ. Число/слово'),
]
